---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFilter.IsElementIdValue
source: html/e96b8bef-b3e3-1a77-f2f5-4ec524f9fcd6.htm
---
# Autodesk.Revit.DB.ScheduleFilter.IsElementIdValue Property

Indicates if the filter has an ElementId value.

## Syntax (C#)
```csharp
public bool IsElementIdValue { get; }
```